s = """           Python – динамічна інтерпретована об’єктно-орієнтованаскриптова мова програмування 
із строгою динамічною типізацією. Розроблена в 1990 році голандським програмістом Гвідо ван Россумом .
Python – багатоцільова мова програмування, яка дозволяє писати код, що добре читається. Відносний лаконізм мови Python
 дозволяє створити програму, яка буде набагато коротше свого аналога, написаного на іншій мові.    """

s1 = s.strip() #Видалення пробілів в кінці та спочатку рядка (Светюха Катерина)
r = s1.replace("Python", "Пайтон") #Заміна слова (Светюха Катерина)
l = (len(s1)) #застосування len() для знаходження довжини рядка(Светюха Катерина)
s2 = (s.split()) #застосування split()для перетворення рядка в саисок

print("Рядок після видалення пробілів в початку та в кінці:\n", s1)
print("Рядок після заміни слова Python:\n", r)
print("Довжина рядка:", l)
print("Перетворення рядка в список:\n", s2)